## Plan Result (ptl)




<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.cftapps_kv_access_policy
  * azurerm_key_vault_access_policy.managed_identity_access_policy
  * azurerm_key_vault_secret.kvs
  * azurerm_resource_group.rg
  * azurerm_storage_account.stg
  * azurerm_storage_share.share[0]
  * azurerm_storage_share.share[1]
  * module.azurekeyvault.azurerm_key_vault.kv
  * module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy
  * module.azurekeyvault.azurerm_key_vault_access_policy.developer[0]
  * module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;726c2cc3-b008-4d27-a790-bdfd0845e1eb&#34;]
  * module.azurekeyvault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.cftapps_kv_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "cftapps_kv_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc"
      + object_id               = "726c2cc3-b008-4d27-a790-bdfd0845e1eb"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "726c2cc3-b008-4d27-a790-bdfd0845e1eb"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_secret.kvs will be created
  + resource "azurerm_key_vault_secret" "kvs" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "storage-account-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-neuvector-ptl-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "cftneuvectorptl"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "cft-neuvector-ptl-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # azurerm_storage_share.share[0] will be created
  + resource "azurerm_storage_share" "share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "neuvector-data-00"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "cftneuvectorptl"
      + url                  = (known after apply)
    }

  # azurerm_storage_share.share[1] will be created
  + resource "azurerm_storage_share" "share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "neuvector-data-01"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "cftneuvectorptl"
      + url                  = (known after apply)
    }

  # module.azurekeyvault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "cftneuvector-ptl"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "cft-neuvector-ptl-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b8f08f77-4ce2-43d5-a23b-c7ca735eca02"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.managed_identity_access_policy["726c2cc3-b008-4d27-a790-bdfd0845e1eb"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "726c2cc3-b008-4d27-a790-bdfd0845e1eb"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "cftneuvector-ptl"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":19,"Program":"tfcmt","SHA1":"","Target":"ptl","Vars":{}} -->